In [860]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [861]:
df=pd.read_csv('Salary_Survey.csv')

EDA process

In [863]:
df.head()

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",...,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,...,5-7 years,5-7 years,Master's degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Non-binary,NaN,NaN,NaN,NaN,NaN,NaN
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,...,2 - 4 years,2 - 4 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN

In [864]:
# I am going to drop variables with no values
df=df.drop(columns=['Timestamp', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22'])

In [865]:
# Simplifying observation names
df.columns = ['Age','Industry','Job_title','Additional_job_details','Annual_salary','Monetary_compensation','Currency','Other_Currency','Additional_income_details','Country_of_work','U.S._state_of_work','City_of_work','Years_of_experience','Years_of_experience_in_your_field','Level_of_education','Gender']

In [866]:
df.head()

,Age,Industry,Job_title,Additional_job_details,Annual_salary,Monetary_compensation,Currency,Other_Currency,Additional_income_details,Country_of_work,U.S._state_of_work,City_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education,Gender
0,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman
1,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary
2,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman
3,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman
4,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman

In [867]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28178 entries, 0 to 28177
Data columns (total 16 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Age                                28085 non-null  object
 1   Industry                           28011 non-null  object
 2   Job_title                          28084 non-null  object
 3   Additional_job_details             7267 non-null   object
 4   Annual_salary                      28085 non-null  object
 5   Monetary_compensation              20780 non-null  float64
 6   Currency                           28085 non-null  object
 7   Other_Currency                     207 non-null    object
 8   Additional_income_details          3044 non-null   object
 9   Country_of_work                    28085 non-null  object
 10  U.S._state_of_work                 23059 non-null  object
 11  City_of_work                       28003 non-null  object
 12  Years_of_experience                28085 non-null  object
 13  Years_of_experience_in_your_field  28085 non-null  object
 14  Level_of_education                 27863 non-null  object
 15  Gender                             27914 non-null  object
dtypes: float64(1), object(15)
memory usage: 3.4+ MB

In [868]:
reduced_df = df.drop(columns=['Additional_job_details', 'Monetary_compensation', 'Other_Currency', 'Additional_income_details', 'U.S._state_of_work', 'City_of_work'])

In [869]:
reduced_df.head()

,Age,Industry,Job_title,Annual_salary,Currency,Country_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education,Gender
0,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",USD,United States,5-7 years,5-7 years,Master's degree,Woman
1,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",GBP,United Kingdom,8 - 10 years,5-7 years,College degree,Non-binary
2,25-34,"Accounting, Banking & Finance",Marketing Specialist,"34,000",USD,US,2 - 4 years,2 - 4 years,College degree,Woman
3,25-34,Nonprofits,Program Manager,"62,000",USD,USA,8 - 10 years,5-7 years,College degree,Woman
4,25-34,"Accounting, Banking & Finance",Accounting Manager,"60,000",USD,US,8 - 10 years,5-7 years,College degree,Woman

In [870]:
reduced_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28178 entries, 0 to 28177
Data columns (total 10 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Age                                28085 non-null  object
 1   Industry                           28011 non-null  object
 2   Job_title                          28084 non-null  object
 3   Annual_salary                      28085 non-null  object
 4   Currency                           28085 non-null  object
 5   Country_of_work                    28085 non-null  object
 6   Years_of_experience                28085 non-null  object
 7   Years_of_experience_in_your_field  28085 non-null  object
 8   Level_of_education                 27863 non-null  object
 9   Gender                             27914 non-null  object
dtypes: object(10)
memory usage: 2.1+ MB

In [871]:
# Count of the missing values
reduced_df.isnull().sum()

Age                                   93
Industry                             167
Job_title                             94
Annual_salary                         93
Currency                              93
Country_of_work                       93
Years_of_experience                   93
Years_of_experience_in_your_field     93
Level_of_education                   315
Gender                               264
dtype: int64

In [872]:
# Checking data types
reduced_df.dtypes

Age                                  object
Industry                             object
Job_title                            object
Annual_salary                        object
Currency                             object
Country_of_work                      object
Years_of_experience                  object
Years_of_experience_in_your_field    object
Level_of_education                   object
Gender                               object
dtype: object

In [873]:
reduced_df["Age"].unique()

array(['25-34', '45-54', '35-44', '18-24', '65 or over', '55-64',
       'under 18', nan], dtype=object)

In [874]:
reduced_df.groupby('Age').nunique().head(10)

,Industry,Job_title,Annual_salary,Currency,Country_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education,Gender
Age,,,,,,,,,
18-24,111,957,514,8,82,8,7,6,4
25-34,631,7159,2469,11,249,8,8,6,4
35-44,505,6076,2042,11,206,8,8,6,5
45-54,218,2317,914,10,113,7,7,6,4
55-64,108,793,480,8,50,8,8,6,4
65 or over,30,89,75,5,19,6,7,6,4
under 18,7,14,14,2,7,6,4,4,3

In [875]:
reduced_df["Gender"].unique()

array(['Woman', 'Non-binary', 'Man', nan, 'Other or prefer not to answer',
       'Prefer not to answer'], dtype=object)

In [876]:
reduced_df.groupby('Gender').nunique().head(10)

,Age,Industry,Job_title,Annual_salary,Currency,Country_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education
Gender,,,,,,,,,
Man,7,257,3347,1317,10,177,8,8,6
Non-binary,7,89,629,398,9,51,8,6,6
Other or prefer not to answer,6,39,272,201,8,42,8,8,6
Prefer not to answer,1,1,1,1,1,1,1,1,1
Woman,7,1038,11555,3581,11,314,8,8,6

In [877]:
reduced_df["Industry"].unique()

array(['Education (Higher Education)', 'Computing or Tech',
       'Accounting, Banking & Finance', ..., 'Student ', 'Wine & Spirits',
       'Social networks'], dtype=object)

In [878]:
reduced_df["Job_title"].unique()

array(['Research and Instruction Librarian',
       'Change & Internal Communications Manager', 'Marketing Specialist',
       ..., 'Curriculum Writer', 'Software Engineering Co-Op',
       'Content creator'], dtype=object)

In [879]:
reduced_df["Annual_salary"].unique()

array(['55,000', '54,600', '34,000', ..., '37741', '53060', nan],
      dtype=object)

In [880]:
reduced_df["Currency"].unique()

array(['USD', 'GBP', 'CAD', 'EUR', 'AUD/NZD', 'Other', 'CHF', 'ZAR',
       'SEK', 'HKD', 'JPY', nan], dtype=object)

In [881]:
reduced_df["Country_of_work"].unique()

array(['United States', 'United Kingdom', 'US', 'USA', 'Canada',
       'United Kingdom ', 'usa', 'UK', 'Scotland ', 'U.S.',
       'United States ', 'The Netherlands', 'Australia ', 'Spain', 'us',
       'Usa', 'England', 'finland', 'United States of America', 'France',
       'United states', 'Scotland', 'USA ', 'United states ', 'Germany',
       'UK ', 'united states', 'Ireland', 'India', 'Australia', 'Uk',
       'United States of America ', 'U.S. ', 'canada', 'Canada ', 'U.S>',
       'ISA', 'Argentina', 'Great Britain ', 'US ', 'United State',
       'U.S.A', 'Denmark', 'U.S.A.', 'America', 'Netherlands',
       'netherlands', 'England ', 'united states of america', 'Ireland ',
       'Switzerland', 'Netherlands ', 'Bermuda', 'Us',
       'The United States', 'United State of America', 'Germany ',
       'Malaysia', 'Mexico ', 'United Stated', 'South Africa ', 'Belgium',
       'Northern Ireland', 'u.s.', 'South Africa', 'UNITED STATES',
       'united States', 'Sweden', 'Hong Kong', 'Kuwait', 'Norway',
       'Sri lanka', 'Contracts', 'USA-- Virgin Islands', 'United Statws',
       'England/UK', 'U.S',
       "We don't get raises, we get quarterly bonuses, but they periodically asses income in the area you work, so I got a raise because a 3rd party assessment showed I was paid too little for the area we were located",
       'Unites States ', 'Usa ', 'U.S.A. ', 'England, UK.', 'Greece',
       'Japan', 'U. S. ', 'Britain ', 'United Sates', 'Japan ', 'Austria',
       'Brazil', 'Canada, Ottawa, ontario', 'Global', 'Sweden ',
       'United States of American ', 'FRANCE', 'Uniited States',
       'United Kingdom (England)',
       'Worldwide (based in US but short term trips aroudn the world)',
       'CANADA ', 'Canadw', 'Hungary', 'Luxembourg',
       'United Sates of America', 'ireland',
       'United States (I work from home and my clients are all over the US/Canada/PR',
       'Colombia', 'CANADA', 'Unted States', 'germany', 'United Statesp',
       'United Stattes', 'United Statea', 'United Kingdom.', 'Mexico',
       'New Zealand', 'Trinidad and Tobago', 'Unites States',
       'United Statees', 'United kingdom', 'Cayman Islands',
       'UNited States', 'Can',
       'I am located in Canada but I work for a company in the US',
       'United kingdom ', 'Uniyed states', 'Uniyes States',
       'United States of Americas', 'U.A.', 'Czech republic', 'Czechia',
       'Latvia', 'Finland', 'U. S.', 'Puerto Rico', 'US of A', 'Rwanda',
       'United States of america ', 'United Arab Emirates ',
       'Bangladesh ', 'Spain ', 'U.K. ', 'Romania', 'U.SA',
       'United Kindom', 'United Status', 'New Zealand ',
       'Currently finance', ' U.S.', 'Serbia', 'Philippines', 'Russia ',
       'Poland', 'UXZ', 'czech republic', 'England, UK', 'Turkey',
       'Canda', 'Puerto Rico ', 'Canada and USA', 'Catalonia',
       '$2,175.84/year is deducted for benefits', 'uk', 'France ',
       'Italy (South)', 'Jersey, Channel islands', 'Uk ', 'China',
       'Virginia', 'Afghanistan', 'Israel', 'U.s.', 'Great Britain',
       'U.s.a.', 'USS', 'Denmark ', 'Uniteed States',
       'New Zealand Aotearoa', 'U.K.', 'Hartford',
       'Japan, US Gov position', 'Csnada', 'United Stares', 'New zealand',
       'Mainland China', 'I.S.', 'UK (Northern Ireland)',
       'UK for U.S. company', ' US', 'Unites states ', 'NZ', 'Us ',
       'Hong Kong ', 'Taiwan', 'Canad', 'Unite States', 'australia',
       'The US', 'united states ', 'The Netherlands ', 'Cambodia',
       'United states of America ', 'Vietnam', 'Remote', 'Singapore',
       'South Korea', 'Czech Republic ', 'Thailand', 'Bangladesh',
       'Lithuania', 'Eritrea', 'Indonesia', 'Singapore ',
       'For the United States government, but posted overseas', 'IS',
       'Switzerland ', 'United Kingdomk', 'Italy', ' New Zealand', 'Cuba',
       'Slovenia', 'Australi', "Cote d'Ivoire", 'united kingdom',
       'From Romania, but for an US based company', 'Somalia',
       'Wales (United Kingdom)', 'England, Gb', 'Czech Republic',
       'UnitedStates', 'Sri Lanka', 'spain', 'Danmark',
       'U.K. (northern England)', 'U.K', 'NL', 'the Netherlands',
       'Nederland', 'Slovakia', 'United States of america', 'Portugal ',
       'England, United Kingdom', 'Sierra Leone', 'Englang',
       'United statew', 'UAE', 'Belgium ',
       'bonus based on meeting yearly goals set w/ my supervisor',
       'International ', 'The Bahamas ', 'Wales',
       "I earn commission on sales. If I meet quota, I'm guaranteed another 16k min. Last year i earned an additional 27k. It's not uncommon for people in my space to earn 100k+ after commission. ",
       'Costa Rica', ' United States', 'United Statues', 'Untied States',
       'USA (company is based in a US territory, I work remote)', 'Chile',
       'denmark', 'UK (England)', 'UK, remote', 'Scotland, UK', 'USAB',
       'Unitied States', 'Norway ', 'Qatar', 'United Sttes',
       'Remote (philippines)', 'Brazil ', 'Unites kingdom ',
       'South africa', 'Portugal', 'united stated',
       'United States Of America', 'Nigeria', 'PanamÃ¡',
       'Northern Ireland ', 'england', 'SWITZERLAND',
       'Austria, but I work remotely for a Dutch/British company',
       "I work for an US based company but I'm from Argentina.",
       'I was brought in on this salary to help with the EHR and very quickly was promoted to current position but compensation was not altered. ',
       'Uniter Statez', 'U. S ', 'Congo', 'United states of America',
       'Uruguay', 'Pakistan', 'Brasil', 'USA tomorrow ', 'United Stateds',
       'n/a (remote from wherever I want)', 'singapore',
       'US govt employee overseas, country withheld', 'usa ', 'Malaysia ',
       'Uganda', 'Malta', 'Saudi Arabia', 'Bulgaria', 'Estonia',
       'Morocco', 'new zealand', 'Africa', 'Ecuador', 'Zimbabwe', 'Ghana',
       'San Francisco', 'Usat', 'ðŸ‡ºðŸ‡¸ ', 'Luxemburg', 'Unitef Stated', 'UA',
       'Wales, UK', 'United Stares ', 'Croatia ',
       'England, United Kingdom ', 'United STates', 'USaa', 'uSA',
       'South Korea ', 'The netherlands', 'Ukraine ', 'america',
       'switzerland', 'United States- Puerto Rico',
       'From New Zealand but on projects across APAC', 'Y', 'United y',
       'Wales (UK)', 'Isle of Man', 'Northern Ireland, United Kingdom',
       'europe', 'California ',
       'UK, but for globally fully remote company', 'Australian ',
       'MÃ©xico', 'Jamaica', 'uS', 'USD', 'the netherlands',
       "USA, but for foreign gov't", 'japan', 'Kenya', 'Jordan',
       'United Statss', 'ARGENTINA BUT MY ORG IS IN THAILAND',
       'United states of america', 'UsA',
       'I work for a UAE-based organization, though I am personally in the US.',
       'United  States', 'france', 'Aotearoa New Zealand', 'na', 'Policy',
       'Cyprus', 'hong konh', 'United States is America', 'Liechtenstein',
       'Company in Germany. I work from Pakistan.', 'croatia', 'CanadÃ¡',
       'ENGLAND', 'United States of American', 'U.S.A ', 'INDIA',
       'Bosnia and Herzegovina', 'NIGERIA', 'Poland ', 'pakistan',
       'Nigeria ', 'London', 'ss', 'dbfemf', 'ibdia', 'LOUTRELAND',
       'philippines', 'ff', 'Myanmar', 'Burma', nan], dtype=object)

In [882]:
# Replacing typos and malformed values to get cleaner data
# Using dictionary to replace typos
# typo_corrections = {'US':'U.S.',
#                     'USA':'U.S.',
#                     'United States':'U.S.',
#                     'usa':'U.S.',
#                     'US ':'U.S.',
#                     'United States ':'U.S.',
#                     'USA ':'U.S.',
#                     'united states':'U.S.',
                    
                    
                    
                    
                    
                    
# reduced_df["Country_of_work"]=reduced_df["Country_of_work"].replace(typo_corrections)
# reduced_df["Country_of_work"].unique()

In [883]:
reduced_df["Years_of_experience"].unique()

array(['5-7 years', '8 - 10 years', '2 - 4 years', '21 - 30 years',
       '11 - 20 years', '1 year or less', '41 years or more',
       '31 - 40 years', nan], dtype=object)

In [884]:
reduced_df["Years_of_experience_in_your_field"].unique()

array(['5-7 years', '2 - 4 years', '21 - 30 years', '11 - 20 years',
       '1 year or less', '8 - 10 years', '31 - 40 years',
       '41 years or more', nan], dtype=object)

In [885]:
reduced_df["Level_of_education"].unique()

array(["Master's degree", 'College degree', 'PhD', nan, 'Some college',
       'High School', 'Professional degree (MD, JD, etc.)'], dtype=object)

In [886]:
reduced_df["Gender"].unique()

array(['Woman', 'Non-binary', 'Man', nan, 'Other or prefer not to answer',
       'Prefer not to answer'], dtype=object)

In [887]:
# Creating a list of malformed data and replacing it with Null
# mvp=["...","N/A","Na ","-","NA","None","na","N/a","ekignkfb","rice","ff"]
mvp=["Woman"]
clean_reduced_df=reduced_df.replace(mvp, "Female")

In [888]:
clean_reduced_df["Gender"].unique()

array(['Female', 'Non-binary', 'Man', nan,
       'Other or prefer not to answer', 'Prefer not to answer'],
      dtype=object)

In [889]:
# Creating a malformed data and typos list and replacing it with coutry names to get cleaner data in this observation
mvp_us=["USA", "United States", "usa", "us", "US", "US ", "United States ", "USA ", "united states", "U.S>", "U.S. ","United States of America ","United State","U.S.A","America","united states of america","Us","The United States","U.S.A.",'United Stated','United State of America','u.s.','UNITED STATES','united States','USA-- Virgin Islands','United Statws','U.S','Unites States ','Usa ','U.S.A. ','U. S. ','United Sates','United States of American ','Uniited States','Worldwide (based in US but short term trips aroudn the world)','United Sates of America','United States (I work from home and my clients are all over the US/Canada/PR','Unted States','United Statesp','United Stattes','United Statea','Unites States','United Statees','Uniyes States','UNited States','I am located in Canada but I work for a company in the US','Uniyed states','Uniyes States','United States of Americas','U. S.','United States of America','Usa','United states ','United states','US of A','United States of america ','U.SA','United Status',' U.S.','Puerto Rico ','Canada and USA','Virginia','U.s.','U.s.a.','USS','Uniteed States','Japan, US Gov position','United Stares','Us ','Unite States','The US','united states ','United states of America ','UnitedStates','UK for U.S. company','For the United States government, but posted overseas',' United States', 'United Statues', 'Untied States',
       'USA (company is based in a US territory, I work remote)','united stated',
       'United States Of America','USAB', 'Unitied States',"I work for an US based company but I'm from Argentina.",'Uniter Statez', 'U. S ','United Sttes','Unitef Stated','United states of America','San Francisco', 'Usat', 'ðŸ‡ºðŸ‡¸ ','United States of america','From Romania, but for an US based company','USA tomorrow ',
       'United Stateds','United states of america', 'UsA','United States of American', 'U.S.A ','USaa', 'uSA','US govt employee overseas, country withheld', 'usa ','uS', 'USD','United Stares ','United STates','america','California ','United States is America','United States- Puerto Rico','United Statss','United  States','ISA',' US',
       'Unites states ','United statew',]
clean_reduced_df=reduced_df.replace(mvp_us, "U.S.")

In [890]:
mvp_uk=['United Kingdom','United Kingdom ', 'UK', 'Scotland ','England','Scotland','UK ','Uk','Great Britain ','England ','Northern Ireland','England/UK','England, UK.','Britain ','United Kingdom (England)','United Kingdom.','United kingdom','United kingdom ','U.K. ','England, UK','uk','Jersey, Channel islands', 'Uk ','Great Britain','Hartford','UK (Northern Ireland)','United Kindom','Wales (United Kingdom)', 'England, Gb','Wales','Northern Ireland ', 'england','U.K. (northern England)', 'U.K','UK (England)', 'UK, remote',
       'Scotland, UK','Unites kingdom ','United Kingdomk','united kingdom','Austria, but I work remotely for a Dutch/British company','Wales, UK','England, United Kingdom','Englang','England, United Kingdom ','United y',
       'Wales (UK)', 'Isle of Man', 'Northern Ireland, United Kingdom','ENGLAND','London',]
clean_reduced_df=clean_reduced_df.replace(mvp_uk, "U.K.")

In [891]:
mvp_ca=['canada', 'Canada ','Canada, Ottawa, ontario','Can','CANADA ', 'Canadw','CANADA','Canda','Csnada','Canad','CanadÃ¡',]
clean_reduced_df=clean_reduced_df.replace(mvp_ca, "Canada")

In [892]:
mvp_nz=['New Zealand ','New Zealand Aotearoa', 'New zealand','NZ',' New Zealand','new zealand','Aotearoa New Zealand','New Zealand',]
clean_reduced_df=clean_reduced_df.replace(mvp_nz, "New_Zealand")

In [893]:
mvp_aus=['Australia ','Australia','australia','Australi','Australian ',]
clean_reduced_df=clean_reduced_df.replace(mvp_aus, "Australia")

In [894]:
mvp_nl=['The Netherlands','netherlands','Netherlands ','The Netherlands ','NL','the Netherlands', 'Nederland','The netherlands','the netherlands',]
clean_reduced_df=clean_reduced_df.replace(mvp_nl, "Netherlands")

In [895]:
mvp_esp=['Spain','Spain ','Catalonia','spain',]
clean_reduced_df=clean_reduced_df.replace(mvp_esp, "Spain")

In [896]:
mvp_ie=['Ireland','Ireland ','ireland',]
clean_reduced_df=clean_reduced_df.replace(mvp_ie, "Ireland")

In [897]:
# Creating Other for non defined countries
mvp_other=['Contracts',"We don't get raises, we get quarterly bonuses, but they periodically asses income in the area you work, so I got a raise because a 3rd party assessment showed I was paid too little for the area we were located",'Global','Currently finance','UXZ','$2,175.84/year is deducted for benefits','IS','Remote','I.S.','bonus based on meeting yearly goals set w/ my supervisor',
       'International ',"I earn commission on sales. If I meet quota, I'm guaranteed another 16k min. Last year i earned an additional 27k. It's not uncommon for people in my space to earn 100k+ after commission. ",'Remote (philippines)','I was brought in on this salary to help with the EHR and very quickly was promoted to current position but compensation was not altered. ','n/a (remote from wherever I want)','From New Zealand but on projects across APAC', 'Y', 'europe',
       'UK, but for globally fully remote company',"USA, but for foreign gov't",'Policy','ss', 'dbfemf','LOUTRELAND','ff','Other','Africa',]
clean_reduced_df=clean_reduced_df.replace(mvp_other, "Other")

In [898]:
mvp_ger=['Germany','Germany ','germany','Company in Germany. I work from Pakistan.',]
clean_reduced_df=clean_reduced_df.replace(mvp_ger, "Germany")

In [899]:
mvp_jpn=['Japan', 'Japan ','japan',]
clean_reduced_df=clean_reduced_df.replace(mvp_jpn, "Japan")

In [900]:
mvp_ch=['Switzerland',]
clean_reduced_df=clean_reduced_df.replace(mvp_ch, "Switzerland")

In [901]:
mvp_ind=['India','INDIA','ibdia',]
clean_reduced_df=clean_reduced_df.replace(mvp_ind, "India")

In [902]:
mvp_fr=['France','FRANCE','France ','france',]
clean_reduced_df=clean_reduced_df.replace(mvp_fr, "France")

In [903]:
mvp_den=['Denmark','Denmark ','Danmark','denmark','Denmark ',]
clean_reduced_df=clean_reduced_df.replace(mvp_den, "Denmark")

In [904]:
mvp_rsa=['South Africa ','South Africa','South africa',]
clean_reduced_df=clean_reduced_df.replace(mvp_rsa, "South Africa")

In [905]:
mvp_uae=['United Arab Emirates ','I work for a UAE-based organization, though I am personally in the US.',]
clean_reduced_df=clean_reduced_df.replace(mvp_uae, "UAE")

In [906]:
mvp_mm=['Myanmar', 'Burma',]
clean_reduced_df=clean_reduced_df.replace(mvp_mm, "Myanmar")

In [907]:
mvp_hkg=['Hong Kong','Hong Kong ','hong konh',]
clean_reduced_df=clean_reduced_df.replace(mvp_hkg, "Hong Kong")

In [908]:
mvp_chn=['China','Mainland China',]
clean_reduced_df=clean_reduced_df.replace(mvp_chn, "China")

In [909]:
mvp_cz=['Czech republic','Czechia','czech republic','Czech Republic ','Czech Republic',]
clean_reduced_df=clean_reduced_df.replace(mvp_cz, "Czech Republic")

In [910]:
mvp_ua=['U.A.','UA','Ukraine ',]
clean_reduced_df=clean_reduced_df.replace(mvp_ua, "Ukraine")

In [911]:
mvp_cro=['Croatia ','croatia',]
clean_reduced_df=clean_reduced_df.replace(mvp_cro, "Croatia")

In [912]:
mvp_sg=['Singapore','Singapore ','singapore',]
clean_reduced_df=clean_reduced_df.replace(mvp_sg, "Singapore")

In [913]:
mvp_th=['Thailand','ARGENTINA BUT MY ORG IS IN THAILAND',]
clean_reduced_df=clean_reduced_df.replace(mvp_th, "Thailand")

In [914]:
mvp_se=['Sweden','Sweden ',]
clean_reduced_df=clean_reduced_df.replace(mvp_se, "Sweden")

In [915]:
mvp_mx=['Mexico ','Mexico','MÃ©xico',]
clean_reduced_df=clean_reduced_df.replace(mvp_mx, "Mexico")

In [916]:
mvp_bra=['Brazil','Brazil ','Brasil',]
clean_reduced_df=clean_reduced_df.replace(mvp_bra, "Brazil")

In [917]:
mvp_lux=['Luxembourg','Luxemburg',]
clean_reduced_df=clean_reduced_df.replace(mvp_lux, "Luxemburg")

In [918]:
mvp_lk=['Sri lanka','Sri Lanka',]
clean_reduced_df=clean_reduced_df.replace(mvp_lk, "Sri Lanka")

In [919]:
mvp_fi=['Finland',]
clean_reduced_df=clean_reduced_df.replace(mvp_fi, "Finland")

In [920]:
mvp_ita=['Italy (South)','Italy',]
clean_reduced_df=clean_reduced_df.replace(mvp_ita, "Italy")

In [921]:
mvp_pak=['Pakistan','pakistan',]
clean_reduced_df=clean_reduced_df.replace(mvp_pak, "Pakistan")

In [922]:
mvp_kr=['South Korea','South Korea ',]
clean_reduced_df=clean_reduced_df.replace(mvp_kr, "South Korea")

In [923]:
mvp_bd=['Bangladesh ','Bangladesh',]
clean_reduced_df=clean_reduced_df.replace(mvp_bd, "Bangladesh")

In [924]:
mvp_ph=['philippines',]
clean_reduced_df=clean_reduced_df.replace(mvp_ph, "Philippines")

In [925]:
mvp_civ=["Cote d'Ivoire",]
clean_reduced_df=clean_reduced_df.replace(mvp_civ, "Ivory Coast")

In [926]:
mvp_bel=['Belgium ',]
clean_reduced_df=clean_reduced_df.replace(mvp_bel, "Belgium")

In [927]:
mvp_bhs=['The Bahamas ',]
clean_reduced_df=clean_reduced_df.replace(mvp_bhs, "The Bahamas")

In [928]:
mvp_no=['Norway ',]
clean_reduced_df=clean_reduced_df.replace(mvp_no, "Norway")

In [929]:
mvp_my=['Malaysia ',]
clean_reduced_df=clean_reduced_df.replace(mvp_my, "Malaysia")

In [930]:
mvp_ru=['Russia ',]
clean_reduced_df=clean_reduced_df.replace(mvp_ru, "Russia")

In [931]:
mvp_pt=['Portugal ',]
clean_reduced_df=clean_reduced_df.replace(mvp_pt, "Portugal")

In [932]:
mvp_pl=['Poland ',]
clean_reduced_df=clean_reduced_df.replace(mvp_pl, "Poland")

In [933]:
mvp_pa=['PanamÃ¡',]
clean_reduced_df=clean_reduced_df.replace(mvp_pa, "Panama")

In [934]:
clean_reduced_df["Country_of_work"].unique()

array(['U.S.', 'U.K.', 'Canada', 'Netherlands', 'Australia', 'Spain',
       'finland', 'France', 'Germany', 'Ireland', 'India', 'Argentina',
       'Denmark', 'Switzerland', 'Bermuda', 'Malaysia', 'Mexico',
       'South Africa', 'Belgium', 'Sweden', 'Hong Kong', 'Kuwait',
       'Norway', 'Sri Lanka', 'Other', 'Greece', 'Japan', 'Austria',
       'Brazil', 'Hungary', 'Luxemburg', 'Colombia', 'New_Zealand',
       'Trinidad and Tobago', 'Cayman Islands', 'Ukraine',
       'Czech Republic', 'Latvia', 'Finland', 'Puerto Rico', 'Rwanda',
       'UAE', 'Bangladesh', 'Romania', 'Serbia', 'Philippines', 'Russia',
       'Poland', 'Turkey', 'Italy', 'China', 'Afghanistan', 'Israel',
       'Taiwan', 'Cambodia', 'Vietnam', 'Singapore', 'South Korea',
       'Thailand', 'Lithuania', 'Eritrea', 'Indonesia', 'Switzerland ',
       'Cuba', 'Slovenia', 'Ivory Coast', 'Somalia', 'Slovakia',
       'Portugal', 'Sierra Leone', 'The Bahamas', 'Costa Rica', 'Chile',
       'Qatar', 'Nigeria', 'Panama', 'SWITZERLAND', 'Congo', 'Uruguay',
       'Pakistan', 'Uganda', 'Malta', 'Saudi Arabia', 'Bulgaria',
       'Estonia', 'Morocco', 'Ecuador', 'Zimbabwe', 'Ghana', 'Croatia',
       'switzerland', 'Jamaica', 'Kenya', 'Jordan', 'na', 'Cyprus',
       'Liechtenstein', 'Bosnia and Herzegovina', 'NIGERIA', 'Nigeria ',
       'Myanmar', nan], dtype=object)

In [935]:
clean_reduced_df["Gender"].unique()

array(['Woman', 'Non-binary', 'Man', nan, 'Other or prefer not to answer',
       'Prefer not to answer'], dtype=object)

In [936]:
mvp_male=['Man']
clean_reduced_df=clean_reduced_df.replace(mvp_male, "Male")
mvp_female=['Woman',]
clean_reduced_df=clean_reduced_df.replace(mvp_female, "Female")
mvp_other=['Other or prefer not to answer','Prefer not to answer']
clean_reduced_df=clean_reduced_df.replace(mvp_other, "Other or prefer not to answer")
mvp_non_binary=['Non-binary']
clean_reduced_df=clean_reduced_df.replace(mvp_non_binary, "Non-binary")

In [937]:
clean_reduced_df["Gender"].unique()

array(['Female', 'Non-binary', 'Male', nan,
       'Other or prefer not to answer'], dtype=object)

In [938]:
# Creating a list of malformed data and replacing it with Null
mvp=["...","N/A","Na ","-","NA","None","na","N/a","ekignkfb","rice","ff","nan"]
clean_reduced_df=clean_reduced_df.replace(mvp, "nan")

In [939]:
clean_reduced_df["Industry"].unique()

array(['Education (Higher Education)', 'Computing or Tech',
       'Accounting, Banking & Finance', ..., 'Student ', 'Wine & Spirits',
       'Social networks'], dtype=object)

In [940]:
clean_reduced_df["Gender"].unique()

array(['Female', 'Non-binary', 'Male', nan,
       'Other or prefer not to answer'], dtype=object)

In [1079]:
mvp_salary=["11 - 20 years"]
clean_reduced_df=clean_reduced_df.replace(mvp_salary, "0")

In [1081]:
clean_reduced_df["Annual_salary"].unique()

array([       nan, 5.8000e+01, 3.5000e+01, ..., 7.0000e+03, 3.7741e+04,
       5.3060e+04])

In [1083]:
# removing commas from the observation and converting to numeric values just from the Salary observation
clean_reduced_df["Annual_salary"] = clean_reduced_df["Annual_salary"].replace(",", "")

In [1085]:
clean_reduced_df["Annual_salary"].dtypes

dtype('float64')

In [1087]:
clean_reduced_df.head()

,Age,Industry,Job_title,Annual_salary,Currency,Country_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education,Gender
0,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,U.S.,U.S.,5-7 years,5-7 years,Master's degree,Female
1,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,GBP,U.K.,8 - 10 years,5-7 years,College degree,Non-binary
2,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,U.S.,U.S.,2 - 4 years,2 - 4 years,College degree,Female
3,25-34,Nonprofits,Program Manager,NaN,U.S.,U.S.,8 - 10 years,5-7 years,College degree,Female
4,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,U.S.,U.S.,8 - 10 years,5-7 years,College degree,Female

In [1089]:
clean_reduced_df["Currency"].unique()

array(['U.S.', 'GBP', 'CAD', 'EUR', 'AUD/NZD', 'Other', 'CHF', 'ZAR',
       'SEK', 'HKD', 'JPY', nan], dtype=object)

In [941]:
no_nas_df = clean_reduced_df.fillna(0)

In [942]:
no_nas_df.head()

,Age,Industry,Job_title,Annual_salary,Currency,Country_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education,Gender
0,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",U.S.,U.S.,5-7 years,5-7 years,Master's degree,Female
1,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",GBP,U.K.,8 - 10 years,5-7 years,College degree,Non-binary
2,25-34,"Accounting, Banking & Finance",Marketing Specialist,"34,000",U.S.,U.S.,2 - 4 years,2 - 4 years,College degree,Female
3,25-34,Nonprofits,Program Manager,"62,000",U.S.,U.S.,8 - 10 years,5-7 years,College degree,Female
4,25-34,"Accounting, Banking & Finance",Accounting Manager,"60,000",U.S.,U.S.,8 - 10 years,5-7 years,College degree,Female

In [943]:
no_nas_df.dtypes

Age                                  object
Industry                             object
Job_title                            object
Annual_salary                        object
Currency                             object
Country_of_work                      object
Years_of_experience                  object
Years_of_experience_in_your_field    object
Level_of_education                   object
Gender                               object
dtype: object

In [944]:
# FIRST YOU HAVE TO GET RID OF COMMAS

In [945]:
# no_nas_df["Annual_salary"].astype(str).astype(float)

In [946]:
no_nas_df.dtypes

Age                                  object
Industry                             object
Job_title                            object
Annual_salary                        object
Currency                             object
Country_of_work                      object
Years_of_experience                  object
Years_of_experience_in_your_field    object
Level_of_education                   object
Gender                               object
dtype: object

In [1049]:
# Changing the observation to numerical, errors='coerce' changes non numeric values to nan
#clean_reduced_df["Annual_salary"] = pd.to_numeric(clean_reduced_df["Annual_salary"], errors='coerce')

In [1051]:
# clean_reduced_df["Annual_salary"].dtypes

In [1053]:
clean_reduced_df["Annual_salary"].dtypes

dtype('float64')

In [1065]:
# removing commas from the observation and converting to numeric values just from the Salary observation
clean_reduced_df["Annual_salary"] = clean_reduced_df["Annual_salary"].replace(",", "")

In [1057]:
clean_reduced_df["Annual_salary"].dtypes

dtype('float64')

In [1061]:
no_nas_df.head()

,Age,Industry,Job_title,Annual_salary,Currency,Country_of_work,Years_of_experience,Years_of_experience_in_your_field,Level_of_education,Gender
0,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",U.S.,U.S.,5-7 years,5-7 years,Master's degree,Female
1,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",GBP,U.K.,8 - 10 years,5-7 years,College degree,Non-binary
2,25-34,"Accounting, Banking & Finance",Marketing Specialist,"34,000",U.S.,U.S.,2 - 4 years,2 - 4 years,College degree,Female
3,25-34,Nonprofits,Program Manager,"62,000",U.S.,U.S.,8 - 10 years,5-7 years,College degree,Female
4,25-34,"Accounting, Banking & Finance",Accounting Manager,"60,000",U.S.,U.S.,8 - 10 years,5-7 years,College degree,Female